app/controllers/actions_controller.rb

  def index
    @actions = Action.find :all
---
SELECT * FROM "actions"

  def new

    @items = Item.find :all
    @statistics = Statistic.find :all
---
SELECT * FROM "items"
SELECT * FROM "statistics"