app/controllers/inventories_controller.rb

SELECT * FROM "inventories"
---
  def index
    @inventories = Inventory.find :all

INSERT INTO "inventories" ("item_id", "updated_at", "scientist_id", "count", "created_at") VALUES(NULL, '2009-10-19 07:46:39', NULL, NULL, '2009-10-19 07:46:39')
---
  def create
    p params

    inventory = params[ :inventory ]

    scientist_id = inventory[ :scientist_id ]
    item_id = inventory[ :item_id ]
    count = inventory[ :count ]

    Inventory.new( :scientist_id => scientist_id,
                   :item_id => item_id,
                   :count => count ).save