app/controllers/items_controller.rb

SELECT * FROM "recipes" WHERE ("recipes"."id" = 1)
---
  def index
    @items = Item.find( :all )
    @recipes = Recipe.find( :all )