app/controllers/items_controller.rb

  def index
    @items = Item.find( :all )
---
SELECT * FROM "items" WHERE ("items".recipe_id = 1) LIMIT 1

  def create
    item = params[ :item ]
    Item.new( :name => item[ :name ] ).save
---
INSERT INTO "items" ("name", "updated_at", "recipe_id", "created_at") VALUES('Vibrator', '2009-10-19 09:29:18', NULL, '2009-10-19 09:29:18')

  def load_item
    p params
    id = params[ :id ]
    @item = Item.find_by_id id
---
SELECT * FROM "items" WHERE ("items"."id" IS NULL) LIMIT 1