app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.find :all
---
SELECT * FROM "recipes"