app/controllers/scientists_controller.rb

SELECT * FROM "scientists"
---
  def index
    @scientists = Scientist.find :all

SELECT * FROM "scientists" WHERE ("scientists"."id" = '2') LIMIT 1
---
  def load_scientist
    id = params[ :id ]
    @scientist = Scientist.find_by_id id