app/controllers/statistics_controller.rb

  def create
    Statistic.new( :name => params[ :statistic ][ :name ] ).save
---
INSERT INTO "statistics" ("name", "updated_at", "created_at") VALUES(NULL, '2009-10-18 03:12:48', '2009-10-18 03:12:48')

  def destroy
    @skill = Statistic.find_by_id params[ :id ]
---
SELECT * FROM "statistics" WHERE ("statistics"."id" = '2') LIMIT 1